dreamx-assessmennt/app/models/contact.rb

SELECT "contacts".* FROM "contacts"
---
    def to_csv
      attributes = %w{id first_name last_name email note}
      contacts = Contact.all

      CSV.generate(headers: true) do |csv|
        csv << attributes

        contacts.each do |car|