dreamx-assessmennt/app/controllers/api/v1/contacts_controller.rb

INSERT INTO "contacts" ("first_name", "last_name", "email", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

UPDATE "contacts" SET "note" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["note", "This contact is saved by Hamza again"], ["updated_at", "2022-10-05 20:30:37.475332"], ["id", 1]]
---
  def update
    if @contact.update(contact_params)

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
  def destroy
    if @contact.destroy